{
  "sections": [
    {
      "id": "getting-started",
      "title": "Comenzando",
      "description": "Configure su sistema y comprenda los conceptos básicos",
      "steps": [
        {
          "title": "Iniciar Sesión en el Sistema",
          "content": "Use sus credenciales para acceder a MineScheduler. Los usuarios nuevos deberán restablecer su contraseña por seguridad."
        },
        {
          "title": "Comprender el Panel de Control",
          "content": "El panel de inicio proporciona una visión general del estado del equipo, cronogramas de mantenimiento y KPIs. Utilícelo como punto de partida cada día."
        },
        {
          "title": "Navegar por la Barra Lateral",
          "content": "Acceda a todos los módulos desde la barra lateral izquierda: Horario, Tareas, Retrasos, Sitios, Equipo y Configuración. Pase el cursor sobre los iconos para ver las etiquetas."
        }
      ]
    },
    {
      "id": "setup",
      "title": "Configuración Inicial",
      "description": "Configure su sistema antes de crear horarios",
      "steps": [
        {
          "title": "Configurar Constantes",
          "content": "Vaya a Configuración → Constantes. Establezca parámetros de minería como ANCHO, ALTURA y DENSIDAD. Estos se utilizan en los cálculos de duración de tareas."
        },
        {
          "title": "Configurar Turnos",
          "content": "Vaya a Configuración → Configuración de Turnos. Defina sus turnos de trabajo (por ejemplo, Turno Diurno 06:00-18:00). Configure las duraciones de cambio de turno para retrasos automáticos."
        },
        {
          "title": "Definir Tipos de Equipo",
          "content": "Vaya a Configuración → Tipos de Equipo. Cree categorías para su equipo (por ejemplo, Perforadoras, Cargadores, Camiones). Esto ayuda a organizar su flota."
        },
        {
          "title": "Configurar Unidades de Medida",
          "content": "Vaya a Configuración → Configuración de UDM. Configure las Unidades de Medida para tareas (metros/hora, toneladas/hora, etc.). Esto determina cómo se calculan las duraciones de las tareas."
        }
      ]
    },
    {
      "id": "tasks",
      "title": "Crear Tareas",
      "description": "Defina las tareas que se programarán",
      "steps": [
        {
          "title": "Agregar Nueva Tarea",
          "content": "Navegue a la página de Tareas. Haga clic en el botón \"Agregar Tarea\". Cada tarea representa una actividad en su ciclo de minería (por ejemplo, Perforación, Carga, Voladura)."
        },
        {
          "title": "Configurar Propiedades de Tarea",
          "content": "Establezca ID de Tarea (código único), Nombre, tipo de UDM, Tasa/Duración, Color y Orden. El Orden determina la secuencia en el ciclo de minería."
        },
        {
          "title": "Establecer Límites de Tarea",
          "content": "Configure cuántos sitios pueden realizar esta tarea simultáneamente por hora. Esto previene conflictos de recursos."
        },
        {
          "title": "Importar Tareas vía Excel",
          "content": "Para configuración masiva, descargue la plantilla, complete los detalles de la tarea e importe. Esto es más rápido para múltiples tareas."
        }
      ]
    },
    {
      "id": "sites",
      "title": "Administrar Sitios",
      "description": "Configure sitios de minería y sus parámetros",
      "steps": [
        {
          "title": "Agregar Sitio",
          "content": "Vaya a la página de Sitios. Haga clic en \"Agregar Sitio\". Ingrese ID de Sitio (por ejemplo, G701), nombre, ubicación y prioridad. Los números de prioridad más bajos se programan primero."
        },
        {
          "title": "Establecer Parámetros del Sitio",
          "content": "Configure Metros Totales del Plan, Toneladas de Relleno, Toneladas Remotas, Ancho y Altura. Estos valores se utilizan para calcular las duraciones de las tareas."
        },
        {
          "title": "Establecer Tarea Actual y Voladuras",
          "content": "Especifique en qué tarea se encuentra actualmente el sitio y el número de ciclos de voladura (voladuras). El sistema programará las tareas en secuencia para cada ciclo."
        },
        {
          "title": "Usar Anulación de Tiempo para Completar",
          "content": "Si sabe exactamente cuánto tiempo tomará la tarea actual, ingréselo en \"Tiempo para Completar (hrs)\". Esto anula la duración calculada para la primera tarea."
        }
      ]
    },
    {
      "id": "equipment",
      "title": "Gestión de Equipo",
      "description": "Rastree y asigne equipo a tareas",
      "steps": [
        {
          "title": "Agregar Equipo",
          "content": "Navegue a la página de Equipo. Agregue su flota con ID de Equipo, Nombre, Tipo y Estado. Rastree especificaciones, ubicación y números de serie."
        },
        {
          "title": "Asignar Tareas al Equipo",
          "content": "En la pestaña \"Tareas\" del formulario de equipo, seleccione qué tareas puede realizar este equipo. Esto vincula el equipo al sistema de programación."
        },
        {
          "title": "Configurar Mantenimiento",
          "content": "Establezca el Intervalo de Mantenimiento (horas) y rastree las Horas de Operación. El sistema calcula cuándo se debe realizar el mantenimiento."
        },
        {
          "title": "Ver Oportunidades de Mantenimiento",
          "content": "La Cuadrícula de Mantenimiento muestra la disponibilidad horaria del equipo. Las celdas azules indican buenos momentos para mantenimiento cuando el equipo no está en uso."
        }
      ]
    },
    {
      "id": "delays",
      "title": "Gestión de Retrasos",
      "description": "Defina y rastree retrasos operacionales",
      "steps": [
        {
          "title": "Configurar Códigos de Retraso",
          "content": "Vaya a la página de Retrasos. Cree códigos de retraso con Categoría (por ejemplo, Equipo, Operacional) y Código (por ejemplo, EQ-001). Agregue descripciones para mayor claridad."
        },
        {
          "title": "Importar Retrasos Estándar",
          "content": "Descargue la plantilla de retrasos, defina sus códigos de retraso estándar e impórtelos. Esto crea un sistema consistente de seguimiento de retrasos."
        },
        {
          "title": "Retrasos Estándar vs Personalizados",
          "content": "Los retrasos estándar tienen duraciones predefinidas. Los retrasos personalizados se ingresan sobre la marcha durante la programación."
        }
      ]
    },
    {
      "id": "maintenance-logs",
      "title": "Registros de Mantenimiento",
      "description": "Rastree y analice el historial de mantenimiento del equipo",
      "steps": [
        {
          "title": "Registrar Eventos de Mantenimiento",
          "content": "Vaya a la página de Registros de Mantenimiento. Haga clic en \"Nuevo Registro\" para registrar actividades de mantenimiento. Seleccione equipo, tipo de mantenimiento (programado/no programado/preventivo/avería), fecha realizada y duración."
        },
        {
          "title": "Rastrear Costos",
          "content": "Ingrese los costos de mano de obra y costos de piezas para cada evento de mantenimiento. Esto ayuda a analizar el costo total de propiedad e identificar equipo costoso."
        },
        {
          "title": "Establecer Fecha de Vencimiento",
          "content": "Al registrar mantenimiento, establezca la próxima fecha de vencimiento de mantenimiento. Esto se integra con el sistema de seguimiento de mantenimiento de equipos."
        },
        {
          "title": "Ver Análisis",
          "content": "Cambie a la pestaña de Análisis para ver tendencias de mantenimiento, costos por equipo, frecuencia de averías y métricas de cumplimiento. Use filtros para analizar equipos o períodos de tiempo específicos."
        },
        {
          "title": "Importar Historial de Mantenimiento",
          "content": "Haga clic en \"Importar\" para cargar masivamente datos históricos de mantenimiento a través de Excel. Descargue la plantilla, complete los registros de mantenimiento e importe para construir su base de datos de historial de mantenimiento."
        },
        {
          "title": "Exportar Informes",
          "content": "Haga clic en \"Exportar a Excel\" para descargar registros de mantenimiento para informes o análisis. Los resultados filtrados se exportarán según sus selecciones de filtro actuales."
        }
      ]
    },
    {
      "id": "scheduling",
      "title": "Crear un Horario",
      "description": "Genere y administre su horario de mina",
      "steps": [
        {
          "title": "Navegar a la Página de Horario",
          "content": "Haga clic en Horario en la barra lateral. Elija entre vista de cuadrícula de 24 horas o 48 horas usando el interruptor en la parte superior."
        },
        {
          "title": "Generar Horario",
          "content": "Haga clic en el botón \"Generar Horario\". El sistema calcula las asignaciones de tareas según sus sitios, tareas y configuración. Esto toma unos segundos."
        },
        {
          "title": "Comprender la Cuadrícula",
          "content": "Cada fila es un sitio, cada columna es una hora. Las celdas codificadas por colores muestran qué tarea está programada. Los sitios prioritarios aparecen primero. Los sitios inactivos están atenuados."
        },
        {
          "title": "Agregar Retrasos",
          "content": "Haga clic en cualquier celda o encabezado de hora para marcar retrasos. Seleccione categoría de retraso, código, duración y notas. Los retrasos bloquean la asignación de tareas para ese período."
        },
        {
          "title": "Regenerar con Retrasos",
          "content": "Después de agregar retrasos, haga clic en \"Generar Horario\" nuevamente. El sistema reprogramará alrededor de las horas bloqueadas."
        },
        {
          "title": "Guardar como Instantánea",
          "content": "Haga clic en \"Guardar Instantánea\" para preservar esta versión del horario. Déle un nombre y descripción. Acceda a instantáneas históricas en cualquier momento."
        },
        {
          "title": "Alternar Estado del Sitio",
          "content": "Haga clic en el nombre del sitio en la cuadrícula para alternar activo/inactivo. Los sitios inactivos se omiten en la programación pero permanecen visibles para referencia."
        }
      ]
    },
    {
      "id": "core-logic",
      "title": "Cómo Funciona la Lógica Principal",
      "description": "Comprender los algoritmos de programación y mantenimiento",
      "steps": [
        {
          "title": "Task Duration Calculation",
          "content": "The system calculates task durations based on Unit of Measure (UOM) types: (1) Area-based: Duration = (Total Plan Meters ÷ Rate m/h) × 60. For example, 100m at 10m/h = 10 hours. (2) Tonnage-based: Duration = (Total Backfill Tonnes × 60) ÷ Rate t/h. If tonnes not provided, calculates from Width × Height × Length × Density. (3) BOGT (Bogger/Trolley): Duration = (Remote Tonnes ÷ Rate) × 60. (4) BFP (Backfill Prep): Uses fixed duration only if tonnes > 0, skips if no backfill. (5) Task (Fixed): Uses configured duration in minutes directly. All durations are rounded up to next whole hour."
        },
        {
          "title": "Priority-Based Allocation",
          "content": "Sites are sorted by Priority (lower number = higher priority) before scheduling. Active sites come first, then inactive. The scheduler processes sites in this order, allocating tasks sequentially. This ensures critical sites get scheduled first when resources are limited."
        },
        {
          "title": "Task Cycling & Firings",
          "content": "Firings represent blast cycles. For Firings = 1: System schedules tasks from current task to end of cycle (no wrap). For Firings > 1: System schedules complete mining cycle (drill → charge → blast → ventilate → etc.) and repeats it \"Firings\" times. Tasks follow the Order sequence defined in Tasks page."
        },
        {
          "title": "Time to Complete Override",
          "content": "When \"Time to Complete\" is set for a site, it overrides the calculated duration ONLY for the first occurrence of the current task. Subsequent tasks and cycles use normal duration calculations. This is useful when you know exact remaining time for an in-progress task."
        },
        {
          "title": "Task Limits Enforcement",
          "content": "Each task has a \"Limit\" defining max simultaneous sites per hour. For example, if Drill limit = 2, only 2 sites can drill in the same hour. The scheduler checks hourly allocation and skips hours where limit is reached, moving to the next available hour. This prevents equipment conflicts."
        },
        {
          "title": "Delay Handling",
          "content": "Delays block specific hours for specific sites. When generating schedule, the system builds a delay map and skips those hours during allocation. This forces tasks to be scheduled around delays. Shift changeover delays are automatically generated based on shift configuration."
        },
        {
          "title": "Hour Allocation Algorithm",
          "content": "For each site, the scheduler: (1) Starts at hour 0 or last filled hour. (2) Checks if hour is delayed - if yes, skip to next hour. (3) Checks if cell already filled - if yes, skip to next hour. (4) Checks task limit for that hour - if reached, skip to next hour. (5) If all checks pass, allocate task to that hour and increment counter. (6) Repeat until all hours for task are allocated or grid ends."
        },
        {
          "title": "Maintenance Opportunity Grid Logic",
          "content": "Equipment is assigned to specific tasks via \"Assigned Tasks\" field. The system: (1) Checks each hour to see which tasks are running (from schedule grid). (2) If ANY task assigned to an equipment is running, marks equipment as \"In Use\" (Green). (3) If equipment is operational AND not in use, marks hour as \"Maintenance Window\" (Blue). (4) Considers operating hours vs maintenance interval to show status: Good (< 80%), Due Soon (80-99%), Overdue (≥ 100%)."
        },
        {
          "title": "Equipment Maintenance Calculation",
          "content": "Maintenance status is calculated as: Percent Used = (Operating Hours ÷ Maintenance Interval) × 100. For example, equipment with 450 hours operated and 500-hour interval = 90% (Due Soon). Hours Until Maintenance = Maintenance Interval - Operating Hours. The system tracks this automatically and shows visual indicators (Green/Orange/Red)."
        },
        {
          "title": "Shift Changeover Auto-Delay",
          "content": "When shifts are configured with changeover duration (e.g., 30 minutes), the system automatically blocks the hour BEFORE each shift starts. For example: Day shift starts at 06:00 with 30-min changeover → Hour 5 (05:00-06:00) is automatically blocked for ALL active sites. This prevents task allocation during crew changes."
        },
        {
          "title": "Schedule Grid Color Coding",
          "content": "Each task has a unique color defined in Tasks page. The grid uses these colors to visualize the schedule. Empty cells = white (available), Colored cells = task assigned, Gray cells = inactive site, Delayed cells show with visual indicators. This provides instant visual understanding of the schedule."
        },
        {
          "title": "Snapshot & History",
          "content": "Snapshots save complete schedule state including: grid allocation, task durations, site priorities, delays, and all parameters. This allows: (1) Historical comparison - see how schedules evolved. (2) Rollback capability - restore previous versions. (3) Audit trail - track schedule changes over time. Snapshots are immutable once saved."
        }
      ]
    },
    {
      "id": "tips",
      "title": "Best Practices & Tips",
      "description": "Optimize your scheduling workflow",
      "steps": [
        {
          "title": "Set Priorities Correctly",
          "content": "Lower priority numbers = higher importance. Use priorities to control which sites get scheduled first when resources are limited."
        },
        {
          "title": "Use Task Orders",
          "content": "Task order defines the mining cycle sequence. Ensure tasks are numbered correctly (e.g., 1=Drill, 2=Charge, 3=Blast, 4=Ventilate)."
        },
        {
          "title": "Leverage Excel Import",
          "content": "For initial setup or bulk updates, use Excel import. Download templates, fill offline, and import. This is much faster than manual entry."
        },
        {
          "title": "Monitor Equipment Maintenance",
          "content": "Check the Equipment Dashboard regularly. Schedule maintenance during \"blue\" hours in the Maintenance Grid when equipment is available."
        },
        {
          "title": "Use Shift Changeover",
          "content": "Configure shift changeover durations in Settings. The system automatically blocks those hours, preventing task allocation during crew changes."
        },
        {
          "title": "Review Audit Logs",
          "content": "Admins can check Audit page to see who made changes and when. This helps track schedule modifications and maintain accountability."
        },
        {
          "title": "Save Snapshots Regularly",
          "content": "Create snapshots before major changes. This lets you compare schedules and revert if needed. Name them clearly (e.g., \"Week 12 - Initial\")."
        },
        {
          "title": "Understand UOM Types",
          "content": "Area-based (m/h), Tonnage-based (t/h), BOGT (trolley), BFP (backfill prep), and Task (fixed time). Choose the right UOM for accurate duration calculations."
        }
      ]
    }
  ]
}
