{
  "sections": [
    {
      "id": "getting-started",
      "title": "Comenzando",
      "description": "Configure su sistema y comprenda los conceptos básicos",
      "steps": [
        {
          "title": "Iniciar Sesión en el Sistema",
          "content": "Use sus credenciales para acceder a MineScheduler. Los usuarios nuevos deberán restablecer su contraseña por seguridad."
        },
        {
          "title": "Comprender el Panel de Control",
          "content": "El panel de inicio proporciona una visión general del estado del equipo, cronogramas de mantenimiento y KPIs. Utilícelo como punto de partida cada día."
        },
        {
          "title": "Navegar por la Barra Lateral",
          "content": "Acceda a todos los módulos desde la barra lateral izquierda: Horario, Tareas, Retrasos, Sitios, Equipo y Configuración. Pase el cursor sobre los iconos para ver las etiquetas."
        }
      ]
    },
    {
      "id": "setup",
      "title": "Configuración Inicial",
      "description": "Configure su sistema antes de crear horarios",
      "steps": [
        {
          "title": "Configurar Constantes",
          "content": "Vaya a Configuración → Constantes. Establezca parámetros de minería como ANCHO, ALTURA y DENSIDAD. Estos se utilizan en los cálculos de duración de tareas."
        },
        {
          "title": "Configurar Turnos",
          "content": "Vaya a Configuración → Configuración de Turnos. Defina sus turnos de trabajo (por ejemplo, Turno Diurno 06:00-18:00). Configure las duraciones de cambio de turno para retrasos automáticos."
        },
        {
          "title": "Definir Tipos de Equipo",
          "content": "Vaya a Configuración → Tipos de Equipo. Cree categorías para su equipo (por ejemplo, Perforadoras, Cargadores, Camiones). Esto ayuda a organizar su flota."
        },
        {
          "title": "Configurar Unidades de Medida",
          "content": "Vaya a Configuración → Configuración de UDM. Configure las Unidades de Medida para tareas (metros/hora, toneladas/hora, etc.). Esto determina cómo se calculan las duraciones de las tareas."
        }
      ]
    },
    {
      "id": "tasks",
      "title": "Crear Tareas",
      "description": "Defina las tareas que se programarán",
      "steps": [
        {
          "title": "Agregar Nueva Tarea",
          "content": "Navegue a la página de Tareas. Haga clic en el botón \"Agregar Tarea\". Cada tarea representa una actividad en su ciclo de minería (por ejemplo, Perforación, Carga, Voladura)."
        },
        {
          "title": "Configurar Propiedades de Tarea",
          "content": "Establezca ID de Tarea (código único), Nombre, tipo de UDM, Tasa/Duración, Color y Orden. El Orden determina la secuencia en el ciclo de minería."
        },
        {
          "title": "Establecer Límites de Tarea",
          "content": "Configure cuántos sitios pueden realizar esta tarea simultáneamente por hora. Esto previene conflictos de recursos."
        },
        {
          "title": "Importar Tareas vía Excel",
          "content": "Para configuración masiva, descargue la plantilla, complete los detalles de la tarea e importe. Esto es más rápido para múltiples tareas."
        }
      ]
    },
    {
      "id": "sites",
      "title": "Administrar Sitios",
      "description": "Configure sitios de minería y sus parámetros",
      "steps": [
        {
          "title": "Agregar Sitio",
          "content": "Vaya a la página de Sitios. Haga clic en \"Agregar Sitio\". Ingrese ID de Sitio (por ejemplo, G701), nombre, ubicación y prioridad. Los números de prioridad más bajos se programan primero."
        },
        {
          "title": "Establecer Parámetros del Sitio",
          "content": "Configure Metros Totales del Plan, Toneladas de Relleno, Toneladas Remotas, Ancho y Altura. Estos valores se utilizan para calcular las duraciones de las tareas."
        },
        {
          "title": "Establecer Tarea Actual y Voladuras",
          "content": "Especifique en qué tarea se encuentra actualmente el sitio y el número de ciclos de voladura (voladuras). El sistema programará las tareas en secuencia para cada ciclo."
        },
        {
          "title": "Usar Anulación de Tiempo para Completar",
          "content": "Si sabe exactamente cuánto tiempo tomará la tarea actual, ingréselo en \"Tiempo para Completar (hrs)\". Esto anula la duración calculada para la primera tarea."
        }
      ]
    },
    {
      "id": "equipment",
      "title": "Gestión de Equipo",
      "description": "Rastree y asigne equipo a tareas",
      "steps": [
        {
          "title": "Agregar Equipo",
          "content": "Navegue a la página de Equipo. Agregue su flota con ID de Equipo, Nombre, Tipo y Estado. Rastree especificaciones, ubicación y números de serie."
        },
        {
          "title": "Asignar Tareas al Equipo",
          "content": "En la pestaña \"Tareas\" del formulario de equipo, seleccione qué tareas puede realizar este equipo. Esto vincula el equipo al sistema de programación."
        },
        {
          "title": "Configurar Mantenimiento",
          "content": "Establezca el Intervalo de Mantenimiento (horas) y rastree las Horas de Operación. El sistema calcula cuándo se debe realizar el mantenimiento."
        },
        {
          "title": "Ver Oportunidades de Mantenimiento",
          "content": "La Cuadrícula de Mantenimiento muestra la disponibilidad horaria del equipo. Las celdas azules indican buenos momentos para mantenimiento cuando el equipo no está en uso."
        }
      ]
    },
    {
      "id": "delays",
      "title": "Gestión de Retrasos",
      "description": "Defina y rastree retrasos operacionales",
      "steps": [
        {
          "title": "Configurar Códigos de Retraso",
          "content": "Vaya a la página de Retrasos. Cree códigos de retraso con Categoría (por ejemplo, Equipo, Operacional) y Código (por ejemplo, EQ-001). Agregue descripciones para mayor claridad."
        },
        {
          "title": "Importar Retrasos Estándar",
          "content": "Descargue la plantilla de retrasos, defina sus códigos de retraso estándar e impórtelos. Esto crea un sistema consistente de seguimiento de retrasos."
        },
        {
          "title": "Retrasos Estándar vs Personalizados",
          "content": "Los retrasos estándar tienen duraciones predefinidas. Los retrasos personalizados se ingresan sobre la marcha durante la programación."
        }
      ]
    },
    {
      "id": "maintenance-logs",
      "title": "Registros de Mantenimiento",
      "description": "Rastree y analice el historial de mantenimiento del equipo",
      "steps": [
        {
          "title": "Registrar Eventos de Mantenimiento",
          "content": "Vaya a la página de Registros de Mantenimiento. Haga clic en \"Nuevo Registro\" para registrar actividades de mantenimiento. Seleccione equipo, tipo de mantenimiento (programado/no programado/preventivo/avería), fecha realizada y duración."
        },
        {
          "title": "Rastrear Costos",
          "content": "Ingrese los costos de mano de obra y costos de piezas para cada evento de mantenimiento. Esto ayuda a analizar el costo total de propiedad e identificar equipo costoso."
        },
        {
          "title": "Establecer Fecha de Vencimiento",
          "content": "Al registrar mantenimiento, establezca la próxima fecha de vencimiento de mantenimiento. Esto se integra con el sistema de seguimiento de mantenimiento de equipos."
        },
        {
          "title": "Ver Análisis",
          "content": "Cambie a la pestaña de Análisis para ver tendencias de mantenimiento, costos por equipo, frecuencia de averías y métricas de cumplimiento. Use filtros para analizar equipos o períodos de tiempo específicos."
        },
        {
          "title": "Importar Historial de Mantenimiento",
          "content": "Haga clic en \"Importar\" para cargar masivamente datos históricos de mantenimiento a través de Excel. Descargue la plantilla, complete los registros de mantenimiento e importe para construir su base de datos de historial de mantenimiento."
        },
        {
          "title": "Exportar Informes",
          "content": "Haga clic en \"Exportar a Excel\" para descargar registros de mantenimiento para informes o análisis. Los resultados filtrados se exportarán según sus selecciones de filtro actuales."
        }
      ]
    },
    {
      "id": "scheduling",
      "title": "Crear un Horario",
      "description": "Genere y administre su horario de mina",
      "steps": [
        {
          "title": "Navegar a la Página de Horario",
          "content": "Haga clic en Horario en la barra lateral. Elija entre vista de cuadrícula de 24 horas o 48 horas usando el interruptor en la parte superior."
        },
        {
          "title": "Generar Horario",
          "content": "Haga clic en el botón \"Generar Horario\". El sistema calcula las asignaciones de tareas según sus sitios, tareas y configuración. Esto toma unos segundos."
        },
        {
          "title": "Comprender la Cuadrícula",
          "content": "Cada fila es un sitio, cada columna es una hora. Las celdas codificadas por colores muestran qué tarea está programada. Los sitios prioritarios aparecen primero. Los sitios inactivos están atenuados."
        },
        {
          "title": "Agregar Retrasos",
          "content": "Haga clic en cualquier celda o encabezado de hora para marcar retrasos. Seleccione categoría de retraso, código, duración y notas. Los retrasos bloquean la asignación de tareas para ese período."
        },
        {
          "title": "Regenerar con Retrasos",
          "content": "Después de agregar retrasos, haga clic en \"Generar Horario\" nuevamente. El sistema reprogramará alrededor de las horas bloqueadas."
        },
        {
          "title": "Guardar como Instantánea",
          "content": "Haga clic en \"Guardar Instantánea\" para preservar esta versión del horario. Déle un nombre y descripción. Acceda a instantáneas históricas en cualquier momento."
        },
        {
          "title": "Alternar Estado del Sitio",
          "content": "Haga clic en el nombre del sitio en la cuadrícula para alternar activo/inactivo. Los sitios inactivos se omiten en la programación pero permanecen visibles para referencia."
        }
      ]
    },
    {
      "id": "core-logic",
      "title": "Cómo Funciona la Lógica Principal",
      "description": "Comprender los algoritmos de programación y mantenimiento",
      "steps": [
        {
          "title": "Cálculo de Duración de Tareas",
          "content": "El sistema calcula las duraciones de tareas basándose en tipos de Unidad de Medida (UDM): (1) Basado en área: Duración = (Metros Totales del Plan ÷ Tasa m/h) × 60. Por ejemplo, 100m a 10m/h = 10 horas. (2) Basado en tonelaje: Duración = (Toneladas Totales de Relleno × 60) ÷ Tasa t/h. Si no se proporcionan toneladas, calcula desde Ancho × Altura × Longitud × Densidad. (3) BOGT (Trolley): Duración = (Toneladas Remotas ÷ Tasa) × 60. (4) BFP (Preparación de Relleno): Usa duración fija solo si toneladas > 0, omite si no hay relleno. (5) Tarea (Fija): Usa duración configurada en minutos directamente. Todas las duraciones se redondean hacia arriba a la siguiente hora completa."
        },
        {
          "title": "Asignación Basada en Prioridad",
          "content": "Los sitios se ordenan por Prioridad (número menor = mayor prioridad) antes de programar. Los sitios activos vienen primero, luego los inactivos. El programador procesa los sitios en este orden, asignando tareas secuencialmente. Esto asegura que los sitios críticos se programen primero cuando los recursos son limitados."
        },
        {
          "title": "Ciclado de Tareas y Voladuras",
          "content": "Las voladuras representan ciclos de voladura. Para Voladuras = 1: El sistema programa tareas desde la tarea actual hasta el final del ciclo (sin envolver). Para Voladuras > 1: El sistema programa el ciclo de minería completo (perforar → cargar → volar → ventilar → etc.) y lo repite \"Voladuras\" veces. Las tareas siguen la secuencia de Orden definida en la página de Tareas."
        },
        {
          "title": "Anulación de Tiempo para Completar",
          "content": "Cuando se establece \"Tiempo para Completar\" para un sitio, anula la duración calculada SOLO para la primera ocurrencia de la tarea actual. Las tareas y ciclos subsiguientes usan cálculos de duración normales. Esto es útil cuando conoce el tiempo restante exacto para una tarea en progreso."
        },
        {
          "title": "Aplicación de Límites de Tarea",
          "content": "Cada tarea tiene un \"Límite\" que define el máximo de sitios simultáneos por hora. Por ejemplo, si el límite de Perforación = 2, solo 2 sitios pueden perforar en la misma hora. El programador verifica la asignación horaria y omite horas donde se alcanza el límite, moviéndose a la siguiente hora disponible. Esto previene conflictos de equipos."
        },
        {
          "title": "Manejo de Retrasos",
          "content": "Los retrasos bloquean horas específicas para sitios específicos. Al generar el horario, el sistema construye un mapa de retrasos y omite esas horas durante la asignación. Esto fuerza que las tareas se programen alrededor de los retrasos. Los retrasos de cambio de turno se generan automáticamente según la configuración de turnos."
        },
        {
          "title": "Algoritmo de Asignación Horaria",
          "content": "Para cada sitio, el programador: (1) Comienza en la hora 0 o la última hora llena. (2) Verifica si la hora está retrasada - si sí, salta a la siguiente hora. (3) Verifica si la celda ya está llena - si sí, salta a la siguiente hora. (4) Verifica el límite de tarea para esa hora - si se alcanzó, salta a la siguiente hora. (5) Si todas las verificaciones pasan, asigna la tarea a esa hora e incrementa el contador. (6) Repite hasta que todas las horas para la tarea estén asignadas o termine la cuadrícula."
        },
        {
          "title": "Lógica de Cuadrícula de Oportunidades de Mantenimiento",
          "content": "El equipo se asigna a tareas específicas a través del campo \"Tareas Asignadas\". El sistema: (1) Verifica cada hora para ver qué tareas están ejecutándose (desde la cuadrícula de horario). (2) Si CUALQUIER tarea asignada a un equipo está ejecutándose, marca el equipo como \"En Uso\" (Verde). (3) Si el equipo está operacional Y no está en uso, marca la hora como \"Ventana de Mantenimiento\" (Azul). (4) Considera las horas de operación vs intervalo de mantenimiento para mostrar estado: Bueno (< 80%), Próximo (80-99%), Vencido (≥ 100%)."
        },
        {
          "title": "Cálculo de Mantenimiento de Equipo",
          "content": "El estado de mantenimiento se calcula como: Porcentaje Usado = (Horas de Operación ÷ Intervalo de Mantenimiento) × 100. Por ejemplo, equipo con 450 horas operadas e intervalo de 500 horas = 90% (Próximo). Horas Hasta Mantenimiento = Intervalo de Mantenimiento - Horas de Operación. El sistema rastrea esto automáticamente y muestra indicadores visuales (Verde/Naranja/Rojo)."
        },
        {
          "title": "Auto-Retraso de Cambio de Turno",
          "content": "Cuando los turnos se configuran con duración de cambio (por ejemplo, 30 minutos), el sistema bloquea automáticamente la hora ANTES de que comience cada turno. Por ejemplo: El turno diurno comienza a las 06:00 con cambio de 30 min → Hora 5 (05:00-06:00) se bloquea automáticamente para TODOS los sitios activos. Esto previene la asignación de tareas durante cambios de personal."
        },
        {
          "title": "Codificación de Color de Cuadrícula de Horario",
          "content": "Cada tarea tiene un color único definido en la página de Tareas. La cuadrícula usa estos colores para visualizar el horario. Celdas vacías = blanco (disponible), Celdas coloreadas = tarea asignada, Celdas grises = sitio inactivo, Celdas retrasadas muestran indicadores visuales. Esto proporciona comprensión visual instantánea del horario."
        },
        {
          "title": "Instantánea e Historial",
          "content": "Las instantáneas guardan el estado completo del horario incluyendo: asignación de cuadrícula, duraciones de tareas, prioridades de sitios, retrasos y todos los parámetros. Esto permite: (1) Comparación histórica - ver cómo evolucionaron los horarios. (2) Capacidad de reversión - restaurar versiones anteriores. (3) Pista de auditoría - rastrear cambios de horario a lo largo del tiempo. Las instantáneas son inmutables una vez guardadas."
        }
      ]
    },
    {
      "id": "tips",
      "title": "Mejores Prácticas y Consejos",
      "description": "Optimice su flujo de trabajo de programación",
      "steps": [
        {
          "title": "Establecer Prioridades Correctamente",
          "content": "Números de prioridad menores = mayor importancia. Use prioridades para controlar qué sitios se programan primero cuando los recursos son limitados."
        },
        {
          "title": "Usar Órdenes de Tarea",
          "content": "El orden de tareas define la secuencia del ciclo de minería. Asegúrese de que las tareas estén numeradas correctamente (por ejemplo, 1=Perforar, 2=Cargar, 3=Volar, 4=Ventilar)."
        },
        {
          "title": "Aprovechar Importación Excel",
          "content": "Para configuración inicial o actualizaciones masivas, use importación Excel. Descargue plantillas, complete fuera de línea e importe. Esto es mucho más rápido que la entrada manual."
        },
        {
          "title": "Monitorear Mantenimiento de Equipo",
          "content": "Revise el Panel de Equipo regularmente. Programe mantenimiento durante las horas \"azules\" en la Cuadrícula de Mantenimiento cuando el equipo esté disponible."
        },
        {
          "title": "Usar Cambio de Turno",
          "content": "Configure duraciones de cambio de turno en Configuración. El sistema bloquea automáticamente esas horas, previniendo la asignación de tareas durante cambios de personal."
        },
        {
          "title": "Revisar Registros de Auditoría",
          "content": "Los administradores pueden verificar la página de Auditoría para ver quién hizo cambios y cuándo. Esto ayuda a rastrear modificaciones de horario y mantener responsabilidad."
        },
        {
          "title": "Guardar Instantáneas Regularmente",
          "content": "Cree instantáneas antes de cambios importantes. Esto le permite comparar horarios y revertir si es necesario. Nombre claramente (por ejemplo, \"Semana 12 - Inicial\")."
        },
        {
          "title": "Comprender Tipos de UDM",
          "content": "Basado en área (m/h), Basado en tonelaje (t/h), BOGT (trolley), BFP (preparación de relleno) y Tarea (tiempo fijo). Elija la UDM correcta para cálculos precisos de duración."
        }
      ]
    }
  ]
}
